Revit 2024 API
ParameterTypeId.AnyPatternIdParamNoNo Property
 "Fill Pattern"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId AnyPatternIdParamNoNo { get; }
Visual Basic
Public Shared ReadOnly Property AnyPatternIdParamNoNo As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ AnyPatternIdParamNoNo {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace